podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/MTB_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "MTB_MKL82Z7" ?>
         <name>MTB</name>
         <description>Micro Trace Buffer</description>
         <groupName>MTB</groupName>
         <prependToName>MTB_</prependToName>
         <headerStructName>MTB</headerStructName>
         <baseAddress>0xF0000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xF00</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFA0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFB0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xFC8</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>POSITION</name>
               <description>MTB Position Register</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x3</resetMask>
               <fields>
                  <field>
                     <name>WRAP</name>
                     <description>WRAP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POINTER</name>
                     <description>Trace Packet Address Pointer[28:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MASTER</name>
               <description>MTB Master Register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x80</resetValue>
               <resetMask>0xFFFFFFE0</resetMask>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TSTARTEN</name>
                     <description>Trace Start Input Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTOPEN</name>
                     <description>Trace Stop Input Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFRWPRIV</name>
                     <description>Special Function Register Write Privilege</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMPRIV</name>
                     <description>RAM Privilege</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALTREQ</name>
                     <description>Halt Request</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Main Trace Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLOW</name>
               <description>MTB Flow Register</description>
               <addressOffset>0x8</addressOffset>
               <resetMask>0x4</resetMask>
               <fields>
                  <field>
                     <name>AUTOSTOP</name>
                     <description>AUTOSTOP</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AUTOHALT</name>
                     <description>AUTOHALT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WATERMARK</name>
                     <description>WATERMARK[28:0]</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BASE</name>
               <description>MTB Base Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>BASEADDR</name>
                     <description>BASEADDR</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MODECTRL</name>
               <description>Integration Mode Control Register</description>
               <addressOffset>0xF00</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MODECTRL</name>
                     <description>MODECTRL</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAGSET</name>
               <description>Claim TAG Set Register</description>
               <addressOffset>0xFA0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TAGSET</name>
                     <description>TAGSET</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAGCLEAR</name>
               <description>Claim TAG Clear Register</description>
               <addressOffset>0xFA4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TAGCLEAR</name>
                     <description>TAGCLEAR</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCKACCESS</name>
               <description>Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCKACCESS</name>
                     <description>Hardwired to 0x0000_0000</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCKSTAT</name>
               <description>Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LOCKSTAT</name>
                     <description>LOCKSTAT</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUTHSTAT</name>
               <description>Authentication Status Register</description>
               <addressOffset>0xFB8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BIT0</name>
                     <description>Connected to DBGEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIT2</name>
                     <description>BIT2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICEARCH</name>
               <description>Device Architecture Register</description>
               <addressOffset>0xFBC</addressOffset>
               <access>read-only</access>
               <resetValue>0x47700A31</resetValue>
               <fields>
                  <field>
                     <name>DEVICEARCH</name>
                     <description>DEVICEARCH</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICECFG</name>
               <description>Device Configuration Register</description>
               <addressOffset>0xFC8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEVICECFG</name>
                     <description>DEVICECFG</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVICETYPID</name>
               <description>Device Type Identifier Register</description>
               <addressOffset>0xFCC</addressOffset>
               <access>read-only</access>
               <resetValue>0x31</resetValue>
               <fields>
                  <field>
                     <name>DEVICETYPID</name>
                     <description>DEVICETYPID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>4,5,6,7,0,1,2,3</dimIndex>
               <name>PERIPHID%s</name>
               <description>Peripheral ID Register</description>
               <addressOffset>0xFD0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PERIPHID</name>
                     <description>PERIPHID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>COMPID%s</name>
               <description>Component ID Register</description>
               <addressOffset>0xFF0</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>COMPID</name>
                     <description>Component ID</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
